![sql](img/sql-logo.jpg)

# A beginner's guide to databases, SQL, & using them with `pandas`

**Scenario:** You are a data analyst for the Homeland Security, trying to create reports on the active airports world wide. The data you need to access is in a SQL database. YOu need to be able to query for the data in a database!

## Learning goals:
- Goal 1: Summarize the use case for sql in the data science skill set
- Goal 2: Define key sql terminology
- Goal 3: Get information about DB schema and table structure
- Goal 4: Use basic SQL commands:
    - Construct SQL queries
    - Use `JOIN` to merge tables along logical columns
    - Grouping Data with SQL, inlcuding `HAVING`
- Goal 5: Convert SQL to pandas

## Goal 1: Summarize

To date the data we've seen has looked like [this.](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Intakes/wter-evkm)

That is how we need data to look to run analysis and build models.<br>
But it doesn't _live_ there in it's native state.

[Netflix has a great article](https://medium.com/netflix-techblog/notebook-innovation-591ee3221233) describing three different data roles at their company, their different needs, and their toolsets.

![netflix](img/netflix-data-roles.jpeg)

Examining that graphic, SQL shows up as one of the tools of the _Data Engineer_

Data Engineers provide the essential data architecture services that make data science possible.

![hierarchy](img/ai-hierachy.png)

[Source: Monica Rogati’s fantastic Medium post “The AI Hierarchy of Needs”
](https://hackernoon.com/the-ai-hierarchy-of-needs-18f111fcc007)

## What does it mean to **Engineer Data**?

Let's start with a basic scenario:<br>
You are HR. You have *no* current database. 
How would you set it up?

Data needs considerations:
- What you want to store
- What "views" you anticipate wanting in the future

Structure considerations:
- Speed of retrieval
- How much data you are accessing
- How much you are storing

![etl](img/etl.png)

[img source: Jeff Hammerbacher’s slide from UC Berkeley CS 194 course ](https://bcourses.berkeley.edu/courses/1377158/pages/cs-194-16-introduction-to-data-science-fall-2015)

### What is a Relational Database? 

![rdb](img/relational-dbms-model.png)
[reference for image ](https://www.studytonight.com/dbms/database-model.php)

### POPULAR RDBMS

- SQLite
- MySQL
- PostgreSql
- Oracle DB
- SQL Server

***
### SQL

[History of SQL](https://www.businessnewsdaily.com/5804-what-is-sql.html)

> Future users of large data banks must be protected from having to know how the data is organized in the machine (the internal representation). A prompting service which supplies such information is not a satisfactory solution. Activities of users at terminals and most application programs should remain unaffected when the internal representation of data is changed and even when some aspects of the external representation are changed. Changes in data representation will often be needed as a result of changes in query, update, and report traffic and natural growth in the types of stored information.
.
.
.<br>
<br>
In Section 1 a relational model of data is proposed as a basis for protecting users of formatted data systems from the potentially disruptive changes in data representation caused by growth in the data bank and changes in traffic.

[The original SQL paper from the 1970s.](https://www.seas.upenn.edu/~zives/03f/cis550/codd.pdf)

***
## Goal 2: Database terminology

### Relational Database Schema

![schema](img/MySQL_Schema_Music_Example.png)

[source of image](https://database.guide/what-is-a-database-schema/)

***
### SQLite

<img src="img/SQLite-Python.jpg" width=500>

"SQLite is a C library that provides a lightweight disk-based database that doesn’t require a separate server process and allows accessing the database using a nonstandard variant of the SQL query language. Some applications can use SQLite for internal data storage. It’s also possible to prototype an application using SQLite and then port the code to a larger database such as PostgreSQL or Oracle." - [sqlite documentation](https://docs.python.org/2/library/sqlite3.html)

## But what about connecting to database servers?

To connect to other database types there are many different libraries:
- Oracle: [cx_Oracle](https://oracle.github.io/python-cx_Oracle/)
- MySQL: [MySQL-python](https://github.com/farcepest/MySQLdb1)
- PostgreSQL: [Psycopg2](http://initd.org/psycopg/docs/)
- Microsoft SQL Server: [pymssql](http://www.pymssql.org/en/stable/)

These all implement [PEP 249: DB API v2](https://www.python.org/dev/peps/pep-0249/)

### The Structure of a SQL Query

<img src='img/sql_statement.jpg'/>

***
## Goal 3: Get going with sqlite!

In [1]:
import sqlite3

#### Load a DB object with `connect` and `cursor`

In [2]:
con = sqlite3.connect('data/flights.db')
cursor = con.cursor()

#### Use sqlite_master to find all the tables in the schema
Get the schema of a database from a db in sqlite

In [3]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cursor.fetchall())

[('airports',), ('airlines',), ('routes',)]

In [4]:
cursor.description

(('name', None, None, None, None, None, None),)

In [5]:
cursor.execute("SELECT name, type FROM sqlite_master;")
print(cursor.fetchall())

[('airports', 'table'), ('ix_airports_index', 'index'), ('airlines', 'table'), ('ix_airlines_index', 'index'), ('routes', 'table'), ('ix_routes_index', 'index')]

In [6]:
cursor.execute("SELECT * FROM sqlite_master;")
results = cursor.fetchall()
for res in results:
    print(res)

('table', 'airports', 'airports', 2, 'CREATE TABLE airports (\n[index] INTEGER,\n  [id] TEXT,\n  [name] TEXT,\n  [city] TEXT,\n  [country] TEXT,\n  [code] TEXT,\n  [icao] TEXT,\n  [latitude] TEXT,\n  [longitude] TEXT,\n  [altitude] TEXT,\n  [offset] TEXT,\n  [dst] TEXT,\n  [timezone] TEXT\n)')
('index', 'ix_airports_index', 'airports', 3, 'CREATE INDEX ix_airports_index ON airports ([index])')
('table', 'airlines', 'airlines', 945, 'CREATE TABLE airlines (\n[index] INTEGER,\n  [id] TEXT,\n  [name] TEXT,\n  [alias] TEXT,\n  [iata] TEXT,\n  [icao] TEXT,\n  [callsign] TEXT,\n  [country] TEXT,\n  [active] TEXT\n)')
('index', 'ix_airlines_index', 'airlines', 946, 'CREATE INDEX ix_airlines_index ON airlines ([index])')
('table', 'routes', 'routes', 1393, 'CREATE TABLE routes (\n[index] INTEGER,\n  [airline] TEXT,\n  [airline_id] TEXT,\n  [source] TEXT,\n  [source_id] TEXT,\n  [dest] TEXT,\n  [dest_id] TEXT,\n  [codeshare] TEXT,\n  [stops] TEXT,\n  [equipment] TEXT\n)')
('index', 'ix_routes_index', 'routes', 1394, 'CREATE INDEX ix_routes_index ON routes ([index])')

#### Get information about one table

**A note about** `execute`<br>
Each time you use it, you reset the value of cursor

In [7]:
cursor.execute("SELECT * FROM airports").fetchone()

(0,
 '1',
 'Goroka',
 'Goroka',
 'Papua New Guinea',
 'GKA',
 'AYGA',
 '-6.081689',
 '145.391881',
 '5282',
 '10',
 'U',
 'Pacific/Port_Moresby')

In [8]:
cursor.fetchone()

(1,
 '2',
 'Madang',
 'Madang',
 'Papua New Guinea',
 'MAG',
 'AYMD',
 '-5.207083',
 '145.7887',
 '20',
 '10',
 'U',
 'Pacific/Port_Moresby')

In [9]:
cursor.fetchmany(4)

[(2,
  '3',
  'Mount Hagen',
  'Mount Hagen',
  'Papua New Guinea',
  'HGU',
  'AYMH',
  '-5.826789',
  '144.295861',
  '5388',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (3,
  '4',
  'Nadzab',
  'Nadzab',
  'Papua New Guinea',
  'LAE',
  'AYNZ',
  '-6.569828',
  '146.726242',
  '239',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (4,
  '5',
  'Port Moresby Jacksons Intl',
  'Port Moresby',
  'Papua New Guinea',
  'POM',
  'AYPY',
  '-9.443383',
  '147.22005',
  '146',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (5,
  '6',
  'Wewak Intl',
  'Wewak',
  'Papua New Guinea',
  'WWK',
  'AYWK',
  '-3.583828',
  '143.669186',
  '19',
  '10',
  'U',
  'Pacific/Port_Moresby')]

#### Use description

In [10]:
cursor.description

(('index', None, None, None, None, None, None),
 ('id', None, None, None, None, None, None),
 ('name', None, None, None, None, None, None),
 ('city', None, None, None, None, None, None),
 ('country', None, None, None, None, None, None),
 ('code', None, None, None, None, None, None),
 ('icao', None, None, None, None, None, None),
 ('latitude', None, None, None, None, None, None),
 ('longitude', None, None, None, None, None, None),
 ('altitude', None, None, None, None, None, None),
 ('offset', None, None, None, None, None, None),
 ('dst', None, None, None, None, None, None),
 ('timezone', None, None, None, None, None, None))

#### Or use `Pragma`
`Pragma` tool [link here](https://www.sqlite.org/pragma.html#pragma_table_info)

**output**<br>
`(column id, column name, data type, whether or not the column can be NULL, and the default value for the column)`

In [11]:
cursor.execute("PRAGMA table_info(airports)")
info = cursor.fetchall()
info

[(0, 'index', 'INTEGER', 0, None, 0),
 (1, 'id', 'TEXT', 0, None, 0),
 (2, 'name', 'TEXT', 0, None, 0),
 (3, 'city', 'TEXT', 0, None, 0),
 (4, 'country', 'TEXT', 0, None, 0),
 (5, 'code', 'TEXT', 0, None, 0),
 (6, 'icao', 'TEXT', 0, None, 0),
 (7, 'latitude', 'TEXT', 0, None, 0),
 (8, 'longitude', 'TEXT', 0, None, 0),
 (9, 'altitude', 'TEXT', 0, None, 0),
 (10, 'offset', 'TEXT', 0, None, 0),
 (11, 'dst', 'TEXT', 0, None, 0),
 (12, 'timezone', 'TEXT', 0, None, 0)]

#### Making fetch happen

`.fetchall()` is how you get the query results out of the object.

You can also `.fetchone()` or `.fetchmany()`

**Task:** Get the descriptive data for airlines and routes tables

In [12]:
cursor.execute("PRAGMA table_info(airlines)")
info = cursor.fetchall()
info

[(0, 'index', 'INTEGER', 0, None, 0),
 (1, 'id', 'TEXT', 0, None, 0),
 (2, 'name', 'TEXT', 0, None, 0),
 (3, 'alias', 'TEXT', 0, None, 0),
 (4, 'iata', 'TEXT', 0, None, 0),
 (5, 'icao', 'TEXT', 0, None, 0),
 (6, 'callsign', 'TEXT', 0, None, 0),
 (7, 'country', 'TEXT', 0, None, 0),
 (8, 'active', 'TEXT', 0, None, 0)]

In [13]:
cursor.execute("PRAGMA table_info(routes)")
info = cursor.fetchall()
info

[(0, 'index', 'INTEGER', 0, None, 0),
 (1, 'airline', 'TEXT', 0, None, 0),
 (2, 'airline_id', 'TEXT', 0, None, 0),
 (3, 'source', 'TEXT', 0, None, 0),
 (4, 'source_id', 'TEXT', 0, None, 0),
 (5, 'dest', 'TEXT', 0, None, 0),
 (6, 'dest_id', 'TEXT', 0, None, 0),
 (7, 'codeshare', 'TEXT', 0, None, 0),
 (8, 'stops', 'TEXT', 0, None, 0),
 (9, 'equipment', 'TEXT', 0, None, 0)]

***
## Goal 4: Use basic SQL commands 
- Construct SQL queries
- Use JOIN to merge tables along logical columns
- Grouping Data with SQL

### Construct SQL queries

**Select**

**From**

**Where**

**Order by**

**Limit**

#### Options for each:

**Select**:  `distinct`, using `as` to rename columns, single number aggregates

**From:** also uses aliasing with `as`

**Where**: equals is only one `=`, `between`, `in`, wildcards `%`, `AND`, `OR`, `NOT`

**Order by**: `asc` and `desc`

**Limit**:  #

**Task**: 
- Select only active airlines in the UK from the airlines table
- Select the unique list of countries with airports

In [16]:
cursor.execute("""
SELECT *
FROM airlines
""")
cursor.fetchmany(5)

[(0, '1', 'Private flight', '\\N', '-', None, None, None, 'Y'),
 (1, '2', '135 Airways', '\\N', None, 'GNL', 'GENERAL', 'United States', 'N'),
 (2, '3', '1Time Airline', '\\N', '1T', 'RNX', 'NEXTIME', 'South Africa', 'Y'),
 (3,
  '4',
  '2 Sqn No 1 Elementary Flying Training School',
  '\\N',
  None,
  'WYT',
  None,
  'United Kingdom',
  'N'),
 (4, '5', '213 Flight Unit', '\\N', None, 'TFU', None, 'Russia', 'N')]

In [17]:
cursor.execute("""
SELECT name
FROM airlines
WHERE active = 'Y'
  AND country = 'United Kingdom';
""")
cursor.fetchmany(5)

[('Astraeus',),
 ('Air Southwest',),
 ('Aurigny Air Services',),
 ('Air Wales',),
 ('AD Aviation',)]

### SQL Joins

SQL joins can be used to both **add** data to a table and **remove** data from a table.

<img src="img/venn.png" width=700>

**Task** Write a query that will join the latitude and longitude data from the airports table to the information on the routes table

In [26]:
cursor.execute("""
select r.*, a.longitude, a.latitude
from routes r
left join airports a
on r.'index' = a.'index'""")
print(*cursor.description, sep='\n')

('index', None, None, None, None, None, None)
('airline', None, None, None, None, None, None)
('airline_id', None, None, None, None, None, None)
('source', None, None, None, None, None, None)
('source_id', None, None, None, None, None, None)
('dest', None, None, None, None, None, None)
('dest_id', None, None, None, None, None, None)
('codeshare', None, None, None, None, None, None)
('stops', None, None, None, None, None, None)
('equipment', None, None, None, None, None, None)
('longitude', None, None, None, None, None, None)
('latitude', None, None, None, None, None, None)

### Grouping statements

Combines `select` and `group by` when you want aggregates by values

`select` `min(x)` ... `max()`, `sum()`, etc

`group by x`

**Task**<br>
- Which countries have the highest amount of active airlines?
- Which countries have the highest amount of inactive airlines?
- What about airports by timezones?

In [52]:
# Which countries have the highest amount of active airlines?
cursor.execute("""
-- your code here;
select country, count(active) active
from airlines
where active = 'Y'
group by country
order by active desc
""")
print(*cursor.fetchall(), sep='\n')

('United States', 141)
('Russia', 72)
('United Kingdom', 40)
('Germany', 37)
('Canada', 34)
('Australia', 26)
('China', 25)
('Spain', 24)
('Brazil', 23)
('France', 22)
('Japan', 19)
('Italy', 18)
('Indonesia', 17)
('India', 17)
('Turkey', 16)
('Thailand', 16)
('Sweden', 15)
('Switzerland', 14)
('Ukraine', 13)
('Portugal', 13)
('Mexico', 12)
('Finland', 12)
('Egypt', 12)
('Austria', 12)
('Peru', 11)
('South Africa', 10)
('Greece', 10)
('Argentina', 10)
('Netherlands', 9)
('Iceland', 9)
('Colombia', 9)
('United Arab Emirates', 8)
('Singapore', 8)
('Romania', 8)
('Poland', 8)
('Philippines', 8)
('Vietnam', 7)
('Taiwan', 7)
('Pakistan', 7)
('Malaysia', 7)
('Ireland', 7)
('Iran', 7)
('Ecuador', 7)
('Denmark', 7)
('South Korea', 6)
('Norway', 6)
('Nepal', 6)
('Kazakhstan', 6)
('Israel', 6)
('Georgia', 6)
('Chile', 6)
('Burma', 6)
('Belgium', 6)
('Slovakia', 5)
('Republic of Korea', 5)
('Nigeria', 5)
('Morocco', 5)
('Lithuania', 5)
('Dominican Republic', 5)
('Czech Republic', 5)
('Cambodia', 5)
('Venezuela', 4)
('Uruguay', 4)
('Tunisia', 4)
('Tanzania', 4)
('New Zealand', 4)
('Maldives', 4)
('Latvia', 4)
('Kyrgyzstan', 4)
('Congo (Kinshasa)', 4)
('Azerbaijan', 4)
('Afghanistan', 4)
('Zimbabwe', 3)
('Zambia', 3)
('Uganda', 3)
('Sierra Leone', 3)
('Serbia', 3)
('Saudi Arabia', 3)
('Netherlands Antilles', 3)
('Myanmar', 3)
('Mongolia', 3)
('Mauritania', 3)
('Libya', 3)
('Lebanon', 3)
('Kuwait', 3)
('Kenya', 3)
('Hungary', 3)
('Hong Kong SAR of China', 3)
('Haiti', 3)
('Guinea', 3)
('Estonia', 3)
('Cyprus', 3)
('Cameroon', 3)
('Bulgaria', 3)
('Bangladesh', 3)
('\\N', 2)
('Yemen', 2)
('Uzbekistan', 2)
('Tajikistan', 2)
('Sudan', 2)
('Sri Lanka', 2)
('Russian Federation', 2)
('Qatar', 2)
('Paraguay', 2)
('Papua New Guinea', 2)
('Oman', 2)
('Mozambique', 2)
('Moldova', 2)
('Mauritius', 2)
('Malta', 2)
('Malawi', 2)
('Macedonia', 2)
('Macao', 2)
('Jordan', 2)
('Ivory Coast', 2)
('Iraq', 2)
('Hong Kong', 2)
('Ghana', 2)
('Fiji', 2)
('Eritrea', 2)
('Djibouti', 2)
('Cuba', 2)
('Croatia', 2)
('Costa Rica', 2)
('Bosnia and Herzegovina', 2)
('Bolivia', 2)
('Belize', 2)
('Belarus', 2)
('Barbados', 2)
('Bahamas', 2)
('Armenia', 2)
('Angola', 2)
('Algeria', 2)
('Albania', 2)
(None, 2)
('Vanuatu', 1)
('Turkmenistan', 1)
('Trinidad and Tobago', 1)
('Togo', 1)
('Syrian Arab Republic', 1)
('Syria', 1)
('Suriname', 1)
('Solomon Islands', 1)
('Slovenia', 1)
('Seychelles', 1)
('Senegal', 1)
('Sao Tome and Principe', 1)
('Samoa', 1)
('Saint Vincent and the Grenadines', 1)
('Rwanda', 1)
('Reunion', 1)
('Republic of the Congo', 1)
('Puerto Rico', 1)
('Panama', 1)
('Palau', 1)
('Niger', 1)
('Nauru', 1)
('Namibia', 1)
('Montenegro', 1)
('Marshall Islands', 1)
('Madagascar', 1)
('Luxembourg', 1)
('Lao Peoples Democratic Republic', 1)
('Kiribati', 1)
('Jamaica', 1)
('Honduras', 1)
('Guatemala', 1)
('Guadeloupe', 1)
('Gabon', 1)
('French Polynesia', 1)
('French Guiana', 1)
('Faroe Islands', 1)
('Ethiopia', 1)
('Equatorial Guinea', 1)
("Democratic People's Republic of Korea", 1)
('DRAGON', 1)
('Cook Islands', 1)
('Comoros', 1)
('Cayman Islands', 1)
('Cape Verde', 1)
('Canadian Territories', 1)
('Burundi', 1)
('Burkina Faso', 1)
('Brunei', 1)
('British Virgin Islands', 1)
('Botswana', 1)
('Bhutan', 1)
('Benin', 1)
('Bahrain', 1)
('Aruba', 1)
('Antigua and Barbuda', 1)
('American Samoa', 1)
('AVIANCA', 1)
('ALASKA', 1)
(' S.A.', 1)

In [51]:
# Which countries have the highest amount of inactive airlines?
cursor.execute("""
-- your code here;
select country, count(active) inactive
from airlines
where active = 'N'
group by country
order by inactive desc
""")
print(*cursor.fetchall(), sep='\n')

('United States', 939)
('Mexico', 427)
('United Kingdom', 367)
('Canada', 284)
('Russia', 158)
('Spain', 142)
('France', 97)
('Germany', 94)
('South Africa', 81)
('Nigeria', 80)
('Ukraine', 76)
('Kazakhstan', 73)
('Italy', 72)
('Australia', 67)
('Sweden', 55)
('Sudan', 47)
('Switzerland', 46)
('China', 45)
('Netherlands', 43)
('Austria', 38)
('Egypt', 36)
('Chile', 35)
('Brazil', 35)
('Angola', 35)
('Colombia', 34)
('Thailand', 32)
('Portugal', 32)
('Mauritania', 32)
('Indonesia', 31)
('Kyrgyzstan', 29)
('Czech Republic', 27)
('Japan', 25)
('Dominican Republic', 25)
('Denmark', 25)
('Bulgaria', 25)
('New Zealand', 24)
('Iran', 24)
('United Arab Emirates', 23)
('Turkey', 23)
('Sierra Leone', 23)
('Norway', 23)
('Libya', 23)
('Venezuela', 22)
('Pakistan', 22)
('Uganda', 21)
('Ireland', 21)
('Belgium', 21)
('Zambia', 20)
('Kenya', 20)
('Greece', 19)
('Ecuador', 19)
('Democratic Republic of the Congo', 19)
('Moldova', 17)
('Ghana', 17)
('Israel', 16)
('Peru', 15)
('Ivory Coast', 15)
('Hungary', 15)
('Armenia', 15)
('Slovakia', 14)
('Haiti', 14)
('Argentina', 14)
('Philippines', 13)
('Lithuania', 13)
('Lebanon', 13)
(None, 13)
('Senegal', 12)
('Poland', 12)
('Georgia', 12)
('Cambodia', 12)
('Luxembourg', 11)
('Iceland', 11)
('Guinea', 11)
('Serbia', 10)
('Namibia', 10)
('Gabon', 10)
('Equatorial Guinea', 10)
('Bangladesh', 10)
('Uzbekistan', 9)
('Uruguay', 9)
('Romania', 9)
('Mali', 9)
('Latvia', 9)
('India', 9)
('Democratic Republic of Congo', 9)
('Guinea-Bissau', 8)
('Croatia', 8)
('Chad', 8)
('Barbados', 8)
('Bahrain', 8)
('Malaysia', 7)
('Finland', 7)
('Belarus', 7)
('Tanzania', 6)
('Swaziland', 6)
('Sao Tome and Principe', 6)
('Gambia', 6)
('Djibouti', 6)
('Costa Rica', 6)
('Burkina Faso', 6)
('Bolivia', 6)
('Bahamas', 6)
('Tajikistan', 5)
('Suriname', 5)
('Somali Republic', 5)
('Slovenia', 5)
('S', 5)
('Rwanda', 5)
('Panama', 5)
('Netherland', 5)
('Nepal', 5)
('Mozambique', 5)
('Mongolia', 5)
('Jordan', 5)
('Honduras', 5)
('Guatemala', 5)
('Estonia', 5)
('El Salvador', 5)
('Cyprus', 5)
('Central African Republic', 5)
('Benin', 5)
('Zimbabwe', 4)
('Turks and Caicos Islands', 4)
('Tunisia', 4)
('Syrian Arab Republic', 4)
('Sri Lanka', 4)
('Republic of the Congo', 4)
('Oman', 4)
('Nicaragua', 4)
('Netherlands Antilles', 4)
('Malta', 4)
('Macedonia', 4)
('Guyana', 4)
('Ethiopia', 4)
('Cameroon', 4)
('Aruba', 4)
('Algeria', 4)
('Afghanistan', 4)
('Togo', 3)
('Singapore', 3)
('Saudi Arabia', 3)
('Republic of Korea', 3)
('Papua New Guinea', 3)
('Niger', 3)
('Morocco', 3)
('Maldives', 3)
('Malawi', 3)
('Liberia', 3)
('Fiji', 3)
('Cuba', 3)
('Azerbaijan', 3)
('Antigua and Barbuda', 3)
('Turkmenistan', 2)
('Tonga', 2)
('Solomon Islands', 2)
('Saint Lucia', 2)
('Qatar', 2)
('Palau', 2)
('Madagascar', 2)
('Lao Peoples Democratic Republic', 2)
('Hong Kong SAR of China', 2)
('Comoros', 2)
('Cape Verde', 2)
('Burundi', 2)
('Bosnia and Herzegovina', 2)
('Albania', 2)
('\\N', 1)
('Yemen', 1)
('WATCHDOG', 1)
('Vietnam', 1)
('VELES', 1)
('UNited Kingdom', 1)
('UNIFORM OSCAR', 1)
('Trinidad and Tobago', 1)
('Taiwan', 1)
('Saint Vincent and the Grenadines', 1)
('Saint Kitts and Nevis', 1)
('SWISSBIRD', 1)
('SCHEFF', 1)
('Russian Federation', 1)
('Russia]]', 1)
('RENTAXEL', 1)
('Paraguay', 1)
('ODINN', 1)
('Nauru', 1)
('Montserrat', 1)
('Montenegro', 1)
('Monaco', 1)
('Mauritius', 1)
('Macao', 1)
('LAP', 1)
('Kuwait', 1)
('Kiribati', 1)
('Jamaica', 1)
('Hong Kong', 1)
('Faroe Islands', 1)
("Cote d'Ivoire", 1)
('Cook Islands', 1)
('Congo (Brazzaville)', 1)
('Cayman Islands', 1)
('COMPANY AS', 1)
('Bermuda', 1)
('Belize', 1)
('Air S', 1)
('AZIMUT', 1)
('AVIOQUINTANA', 1)
('AVINOR', 1)
('AVEMEX', 1)
('AUSA', 1)
('AURORA AIR', 1)
('AUDI AIR', 1)
('ATLANTIS CANADA', 1)
('ATLANTIC NICARAGUA', 1)
('ATCO', 1)
('ASUR', 1)
('ASTORIA', 1)
('ASA PESADA', 1)
('ARMSTRONG', 1)
('ARIZAIR', 1)
('AQUILINE', 1)
('APPALACHIAN', 1)
('ANTARES', 1)
('ALNACIONAL', 1)
('ALL STAR', 1)
('ALDAWLYH AIR', 1)
('ALCON', 1)
('ALASKA PACIFIC', 1)
('ALAMO', 1)
('AIRWAVE', 1)
('AIRPORT HELICOPTER', 1)
('AIRPAC', 1)
('AIRNAT', 1)
('AIRMAN', 1)
('AIRFLIGHT', 1)
('AIREX', 1)
('AIR-MAUR', 1)
('AIR PRINT', 1)
('AIR FREIGHTER', 1)
('AIR CLASS', 1)
('AEROWEE', 1)
('AEROVARADERO', 1)
('AEROSUN', 1)
('AEROSOL', 1)
('AEROPUMA', 1)
('AEROPERLAS', 1)
('AEROCESAR', 1)
('AEROCENTER', 1)
('ACTIVE AERO', 1)
('ACOM', 1)
(' Boonville Stage Line', 1)

In [62]:
# What about airports by timezones?
cursor.execute("""
-- your code here;
select timezone,  count(timezone) '# of airports'
from airports
group by timezone
order by 2 desc
""")
print(*cursor.fetchall(), sep='\n')

('America/New_York', 628)
('America/Chicago', 373)
('Europe/Berlin', 319)
('America/Anchorage', 258)
('Europe/Paris', 232)
('America/Los_Angeles', 226)
('Asia/Chongqing', 222)
('Europe/London', 193)
('America/Toronto', 159)
('Asia/Calcutta', 141)
('America/Denver', 135)
('Asia/Tokyo', 131)
('America/Cordoba', 104)
('Africa/Johannesburg', 104)
('Europe/Moscow', 100)
('America/Sao_Paulo', 97)
('Europe/Rome', 93)
('\\N', 92)
('Europe/Stockholm', 86)
('Australia/Brisbane', 81)
('Asia/Tehran', 81)
('America/Vancouver', 78)
('Europe/Istanbul', 77)
('Europe/Madrid', 74)
('America/Bogota', 72)
('Europe/Oslo', 67)
('America/Edmonton', 66)
('America/Winnipeg', 65)
('America/Mexico_City', 65)
('Asia/Manila', 63)
('Europe/Athens', 60)
('Asia/Bangkok', 58)
('America/Caracas', 58)
('Pacific/Port_Moresby', 57)
('Pacific/Auckland', 54)
('Africa/Nairobi', 54)
('Australia/Sydney', 52)
('America/Boa_Vista', 52)
('Europe/Zurich', 50)
('Europe/Helsinki', 50)
('Asia/Jakarta', 49)
('Asia/Karachi', 46)
('Indian/Antananarivo', 45)
('Australia/Perth', 45)
('Asia/Kuala_Lumpur', 45)
('America/Fortaleza', 44)
('Africa/Algiers', 44)
('Asia/Rangoon', 43)
('America/Lima', 43)
('Asia/Riyadh', 42)
('Asia/Makassar', 42)
('America/Phoenix', 42)
('Europe/Amsterdam', 41)
('Indian/Maldives', 38)
('America/Santiago', 37)
('America/Nassau', 37)
('Asia/Katmandu', 36)
('Europe/Warsaw', 35)
('Europe/Brussels', 35)
('America/Guayaquil', 35)
('Europe/Kiev', 33)
('Pacific/Majuro', 32)
('Asia/Taipei', 32)
('Africa/Addis_Ababa', 31)
('Europe/Vienna', 30)
('Asia/Seoul', 30)
('Asia/Saigon', 30)
('Pacific/Efate', 29)
('Asia/Yekaterinburg', 29)
('America/Havana', 29)
('America/Costa_Rica', 29)
('Europe/Copenhagen', 28)
('Africa/Dar_es_Salaam', 28)
('Europe/Prague', 27)
('America/La_Paz', 27)
('America/Halifax', 27)
('Africa/Lagos', 27)
('Pacific/Guadalcanal', 26)
('Europe/Lisbon', 26)
('Europe/Bucharest', 26)
('America/Panama', 26)
('Pacific/Tahiti', 25)
('Pacific/Honolulu', 25)
('Africa/Luanda', 25)
('Africa/Gaborone', 25)
('Asia/Irkutsk', 24)
('Europe/Dublin', 23)
('Australia/Adelaide', 23)
('America/Paramaribo', 23)
('Australia/Hobart', 22)
('Australia/Darwin', 22)
('Atlantic/Reykjavik', 22)
('Asia/Kabul', 22)
('America/Godthab', 22)
('Africa/Tripoli', 22)
('Africa/Maputo', 22)
('Africa/Casablanca', 22)
('Asia/Yakutsk', 21)
('Asia/Qyzylorda', 21)
('Asia/Jayapura', 21)
('America/Cayenne', 21)
('Africa/Cairo', 21)
('Asia/Jerusalem', 20)
('Asia/Vladivostok', 19)
('Asia/Dubai', 19)
('Antarctica/South_Pole', 19)
('America/Regina', 18)
('Africa/Windhoek', 18)
('Africa/Kinshasa', 18)
('Pacific/Fiji', 17)
('Asia/Omsk', 17)
('Asia/Magadan', 16)
('Asia/Krasnoyarsk', 16)
('America/Mazatlan', 16)
('Africa/Harare', 16)
('Asia/Colombo', 15)
('America/Puerto_Rico', 15)
('America/Campo_Grande', 15)
('Africa/Lubumbashi', 15)
('Europe/Budapest', 14)
('America/Santo_Domingo', 14)
('America/Port-au-Prince', 14)
('America/Guyana', 14)
('Africa/Libreville', 14)
('Africa/Khartoum', 14)
('Europe/Zagreb', 13)
('Asia/Phnom_Penh', 13)
('Asia/Hong_Kong', 13)
('Asia/Dhaka', 13)
('Africa/Tunis', 13)
('Africa/Lusaka', 13)
('Asia/Samarkand', 12)
('America/Montevideo', 12)
('America/Belize', 12)
('Pacific/Noumea', 11)
('Asia/Vientiane', 11)
('Asia/Ulaanbaatar', 11)
('Asia/Aden', 11)
('America/Tegucigalpa', 11)
('America/Managua', 11)
('Africa/Nouakchott', 11)
('Africa/Mogadishu', 11)
('Indian/Reunion', 10)
('Indian/Mahe', 10)
('Atlantic/Canary', 10)
('Atlantic/Azores', 10)
('Asia/Baghdad', 10)
('America/Guatemala', 10)
('Africa/Douala', 10)
('Europe/Tallinn', 9)
('Asia/Baku', 9)
('America/St_Johns', 9)
('Africa/Kampala', 9)
('Africa/Dakar', 9)
('Pacific/Tarawa', 8)
('Pacific/Rarotonga', 8)
('Europe/Vilnius', 8)
('Europe/Minsk', 8)
('Europe/Bratislava', 8)
('Asia/Ashgabat', 8)
('America/St_Thomas', 8)
('America/Curacao', 8)
('America/Asuncion', 8)
('Africa/Freetown', 8)
('Africa/Blantyre', 8)
('Africa/Bamako', 8)
('Europe/Sofia', 7)
('Europe/Malta', 7)
('Australia/Melbourne', 7)
('Atlantic/Cape_Verde', 7)
('Asia/Oral', 7)
('Arctic/Longyearbyen', 7)
('America/Jamaica', 7)
('America/Blanc-Sablon', 7)
('Africa/Niamey', 7)
('Africa/Ndjamena', 7)
('Africa/Juba', 7)
('Africa/Abidjan', 7)
('Pacific/Tongatapu', 6)
('Asia/Singapore', 6)
('Asia/Pyongyang', 6)
('Asia/Muscat', 6)
('Asia/Damascus', 6)
('Asia/Amman', 6)
('America/Tijuana', 6)
('America/Guadeloupe', 6)
('America/Grand_Turk', 6)
('Africa/Conakry', 6)
('Africa/Accra', 6)
('Europe/Ljubljana', 5)
('Atlantic/Stanley', 5)
('Asia/Tbilisi', 5)
('America/St_Vincent', 5)
('America/Hermosillo', 5)
('Africa/Brazzaville', 5)
('Pacific/Marquesas', 4)
('Pacific/Apia', 4)
('Indian/Comoro', 4)
('Europe/Sarajevo', 4)
('Europe/Belgrade', 4)
('Asia/Yerevan', 4)
('Asia/Nicosia', 4)
('Asia/Macau', 4)
('Asia/Dushanbe', 4)
('Asia/Bishkek', 4)
('America/Martinique', 4)
('Africa/Kigali', 4)
('Africa/Asmera', 4)
('Pacific/Truk', 3)
('Pacific/Saipan', 3)
('Pacific/Palau', 3)
('Pacific/Pago_Pago', 3)
('Pacific/Galapagos', 3)
('Europe/Riga', 3)
('Europe/Chisinau', 3)
('Atlantic/Faeroe', 3)
('Asia/Qatar', 3)
('Asia/Hovd', 3)
('Asia/Dili', 3)
('America/St_Lucia', 3)
('America/St_Kitts', 3)
('America/Rio_Branco', 3)
('America/Grenada', 3)
('America/Dominica', 3)
('America/Coral_Harbour', 3)
('America/Cayman', 3)
('Africa/Monrovia', 3)
('Africa/Maseru', 3)
('Africa/El_Aaiun', 3)
('Africa/Djibouti', 3)
('Africa/Bangui', 3)
('Pacific/Wallis', 2)
('Pacific/Guam', 2)
('Pacific/Chatham', 2)
('Indian/Mauritius', 2)
('Europe/Skopje', 2)
('Europe/Podgorica', 2)
('Europe/Guernsey', 2)
('Atlantic/St_Helena', 2)
('Atlantic/South_Georgia', 2)
('Atlantic/Bermuda', 2)
('Asia/Kuwait', 2)
('Asia/Gaza', 2)
('Asia/Brunei', 2)
('Asia/Beirut', 2)
('Asia/Bahrain', 2)
('America/Tortola', 2)
('America/Thule', 2)
('America/Scoresbysund', 2)
('America/Port_of_Spain', 2)
('America/Montserrat', 2)
('America/Miquelon', 2)
('America/El_Salvador', 2)
('America/Dawson_Creek', 2)
('America/Danmarkshavn', 2)
('America/Antigua', 2)
('Africa/Sao_Tome', 2)
('Africa/Ouagadougou', 2)
('Africa/Malabo', 2)
('Africa/Lome', 2)
('Africa/Bissau', 2)
('Pacific/Wake', 1)
('Pacific/Ponape', 1)
('Pacific/Norfolk', 1)
('Pacific/Niue', 1)
('Pacific/Nauru', 1)
('Pacific/Midway', 1)
('Pacific/Kosrae', 1)
('Pacific/Johnston', 1)
('Pacific/Gambier', 1)
('Pacific/Funafuti', 1)
('Pacific/Enderbury', 1)
('Pacific/Easter', 1)
('Indian/Mayotte', 1)
('Indian/Cocos', 1)
('Indian/Christmas', 1)
('Indian/Chagos', 1)
('Europe/Vaduz', 1)
('Europe/Tirane', 1)
('Europe/Monaco', 1)
('Europe/Mariehamn', 1)
('Europe/Luxembourg', 1)
('Europe/Kaliningrad', 1)
('Europe/Jersey', 1)
('Europe/Isle_of_Man', 1)
('Europe/Gibraltar', 1)
('Asia/Thimphu', 1)
('America/Barbados', 1)
('America/Aruba', 1)
('America/Anguilla', 1)
('Africa/Porto-Novo', 1)
('Africa/Mbabane', 1)
('Africa/Bujumbura', 1)
('Africa/Banjul', 1)

In [68]:
# It's always a good idea to close our connections when we're done
cursor.close()
con.close()

ProgrammingError: Cannot operate on a closed database.

## Goal 5: Transfering from sqlite to pandas

In [65]:
import pandas as pd

pd_con = sqlite3.connect("data/flights.db")
df = pd.read_sql_query("select * from airports limit 5;", pd_con)
df

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby
1,1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.7887,20,10,U,Pacific/Port_Moresby
2,2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10,U,Pacific/Port_Moresby
3,3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10,U,Pacific/Port_Moresby
4,4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.22005,146,10,U,Pacific/Port_Moresby

**Task**: 
Convert one of the earlier queries in the lesson to a pandas data frame

In [69]:
# Which countries have the highest amount of active airlines?
sql = '''
-- YOUR CODE HERE
select country, count(active) active
from airlines
where active = 'Y'
group by country
order by active desc
'''
pd.read_sql_query(sql, pd_con)

                 country  active
0          United States     141
1                 Russia      72
2         United Kingdom      40
3                Germany      37
4                 Canada      34
..                   ...     ...
190  Antigua and Barbuda       1
191       American Samoa       1
192              AVIANCA       1
193               ALASKA       1
194                 S.A.       1

[195 rows x 2 columns]

In [70]:
pd_con.close()

## Integration

The [Chinook database](https://github.com/lerocha/chinook-database) is a sample database, representing a digital media store.

You need to create a query that can rank tracks in term of popularity.

The name of the database is `Chinook_Sqlite.sqlite`

Database information:<br>
- How many tables are in the database?
- What's the primary key of each table?
- What foreign keys join the tables together?
- If you had to draw a schema of how the tables are connected, what would it look like?

To answer the question:<br>
- What are the max and min dates in the Invoice table?
- What tables would you need to answer "what is your most popular track?"
- What values from each table?

In [121]:
conn = sqlite3.connect('data/Chinook_Sqlite.sqlite')
cur = con.cursor()

In [122]:
# How many tables are in the database?

# your code here
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(len(cur.fetchall()))

11

In [123]:
# What's the primary key of each table?

# your code here
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
fetch = cur.fetchall()
for key in fetch:
    cur.execute(f'PRAGMA table_info({key[0]});')
    print(f'table name:\t{key[0]:20s} primary key:\t{cur.fetchall()[0][1]}' )

table name:	Album                primary key:	AlbumId
table name:	Artist               primary key:	ArtistId
table name:	Customer             primary key:	CustomerId
table name:	Employee             primary key:	EmployeeId
table name:	Genre                primary key:	GenreId
table name:	Invoice              primary key:	InvoiceId
table name:	InvoiceLine          primary key:	InvoiceLineId
table name:	MediaType            primary key:	MediaTypeId
table name:	Playlist             primary key:	PlaylistId
table name:	PlaylistTrack        primary key:	PlaylistId
table name:	Track                primary key:	TrackId

In [124]:
# What foreign keys join the tables together?

# your code here
# hint: use "PRAGMA foreign_key_list()"

In [133]:
# What are the max and min dates in the Invoice table?

sql = '''
-- YOUR CODE HERE
select max(InvoiceDate) latestInvoice, min(InvoiceDate) earliestInvoice
from Invoice
'''
pd.read_sql_query(sql, conn)

         latestInvoice      earliestInvoice
0  2013-12-22 00:00:00  2009-01-01 00:00:00

In [157]:
# What tables would you need to answer "what is your most popular track?"

#### Track and InvoiceLine

In [176]:
# What values from each table?

#### track.name, invoiceline.invoicelineid

In [231]:
# Put it all together:
# You need to create a query that can rank tracks in term of popularity.

sql = '''
-- YOUR CODE HERE

'''
pd.read_sql_query(sql, conn)

                                   Name  num
0                           The Trooper    5
1                              Untitled    4
2               The Number Of The Beast    4
3                   Sure Know Something    4
4                  Hallowed Be Thy Name    4
...                                 ...  ...
1883  (White Man) In Hammersmith Palais    1
1884         (Anesthesia) Pulling Teeth    1
1885                    'Round Midnight    1
1886                           #9 Dream    1
1887                                "?"    1

[1888 rows x 2 columns]

In [234]:
# # Advanced: get the artist who sang the song!
# sql = '''
# -- YOUR CODE HERE
# --select name from artist
# select artist.name 
# from artist join album on artist.artistid = album.artistid 
# join track
# on album.albumid = track.albumid
# join
# (select t.trackid, t.name, count(il.trackid) num
# from invoiceline il
# left join track t
# on t.trackid = il.trackid
# group by name
# order by num desc) butt
# on butt.trackid = album.trackid
# '''

# pd.read_sql_query(sql, conn)

#### GROUP BY

- Group columns by similar values
- SELECT COUNT(id), city from students GROUP BY city

#### HAVING

- Use to apply filter AFTER a `GROUP BY` based on aggregate criteria 
- `WHERE` is applied for conditions prior to the `GROUP BY`, `HAVING` is applied afterwards

For example, if we had a table of student names and the courses they were taking, we could ask a question such as which classes have 3 or more students with the name Matt?

Such a query would look something like this:

```SQL
SELECT
  class,
  COUNT(student_name) AS number_of_alexes
FROM student_courses
WHERE student_name = "Alex"
GROUP BY 1
HAVING COUNT(student_name) >= 2;
```

In [239]:
conn = sqlite3.connect('data/tutorial.db')
c = conn.cursor()

In [243]:
c.execute('select name from sqlite_master')
c.fetchall()

[('responses',)]

In [245]:
columns = [x[0] for x in c.execute('select * from responses').description]

In [246]:
columns

['submitted_ts',
 'name',
 'birthday',
 'hometown',
 'fav_food_1',
 'fav_food_2',
 'time_in_dc',
 'siblings_count']

### Questions
1. What are the names of all of the students?
2. Which student has the most siblings?
3. How many students are only children?
4. Which 3 students have lived in NYC the shortest amount of time?
5. How many students are native New Yorkers?
6. Do any two students have the same favorite food?

1. What are the names of all of the students.

In [256]:
sql = '''
-- YOUR CODE HERE
select name
from responses

'''
pd.read_sql_query(sql, conn)

                name
0            Stephen
1            Donna C
2              Muoyo
3         Vyjayanthi
4       Anesu Masube
5   Michael Pallante
6      Stuart Murphy
7      Darian Madere
8               Alex
9      Justin Fleury
10           Nate Lu
11              Nick
12          Jeff Lin
13             Chuck
14       Jill Carrie
15              Alex
16              Nimu

2. Which student has the most siblings?

In [ ]:
sql = '''
-- YOUR CODE HERE
select name, max(siblings_count) sib
from responses
order by sib desc
'''
pd.read_sql_query(sql, conn)

3. How many students are only children?

In [258]:
sql = '''
-- YOUR CODE HERE
select name, siblings_count sib
from responses
where sib <= 0
'''
pd.read_sql_query(sql, conn)

Empty DataFrame
Columns: [name, sib]
Index: []

4. Which 3 students have lived in NYC the shortest amount of time? (How long has each lived in NYC?)

In [264]:
# there is no data for living in nyc so i used the column time_in_dc instead

sql = '''
-- YOUR CODE HERE
select name, time_in_dc time
from responses
order by time
limit 3
'''
pd.read_sql_query(sql, conn)

      name  time
0  Stephen   0.0
1    Muoyo   0.0
2     Alex   0.0

5. How many students are native New Yorkers?

In [267]:
sql = '''
-- YOUR CODE HERE
select distinct(name), hometown from responses where hometown LIKE '%NY%'
'''
pd.read_sql_query(sql, conn)

    name      hometown
0  Muoyo  Brooklyn, NY
1   Nimu     Nyack, NY

6. Do any two students have the same favorite food?

This problem employs the `Having` clause.  Be sure to review the difference between the where and having clause here. (Where filters apply before the group by clause and conditions following the having clause are filters applied after the group by on the resulting aggregate [statistics].) A useful example in doing so, could be to modify the question to something with an additional filtering criterion such as 'do any native new yorkers have the same favorite food?' This would force students to use a where clause prior to the group by to filter the results. Alternatively, see the question below for an alternative but related problem on favorite foods.

In [272]:
sql = '''
-- YOUR CODE HERE

'''
pd.read_sql_query(sql, conn)

,name,f1,f2
0,Stephen,pizza,beef stroganoff
1,Donna C,shrimp,sushi
2,Muoyo,Nigerian,Thai
3,Vyjayanthi,Pasta,Noodles
4,Anesu Masube,Pork Ribs,Sadza
5,Michael Pallante,Pizza,Pasta
6,Stuart Murphy,Bread,Indian
7,Darian Madere,tater tots,sushi
8,Alex,Ice cream,Carrot cake
9,Justin Fleury,lasagna,brownies
10,Nate Lu,Sushi,Grey
11,Nick,Bacon,Steak
12,Jeff Lin,Dark Chocolate,Coffee
13,Chuck,Crab cakes,Lobster
14,Jill Carrie,Thai,Sushi
15,Alex,A single poached egg on a bed of arugula,Buffalo Wings
16,Nimu,Saag,Zucchini

## More Questions

What are the favorite foods of this classroom?

In [273]:
sql = '''
-- YOUR CODE HERE
select name,  fav_food_1 f1, fav_food_2 f2
from responses

'''
pd.read_sql_query(sql, conn)

,name,f1,f2
0,Stephen,pizza,beef stroganoff
1,Donna C,shrimp,sushi
2,Muoyo,Nigerian,Thai
3,Vyjayanthi,Pasta,Noodles
4,Anesu Masube,Pork Ribs,Sadza
5,Michael Pallante,Pizza,Pasta
6,Stuart Murphy,Bread,Indian
7,Darian Madere,tater tots,sushi
8,Alex,Ice cream,Carrot cake
9,Justin Fleury,lasagna,brownies
10,Nate Lu,Sushi,Grey
11,Nick,Bacon,Steak
12,Jeff Lin,Dark Chocolate,Coffee
13,Chuck,Crab cakes,Lobster
14,Jill Carrie,Thai,Sushi
15,Alex,A single poached egg on a bed of arugula,Buffalo Wings
16,Nimu,Saag,Zucchini

Which student was born closest to the cohort's graduation date (5/29/20)?

In [284]:
# sql = '''
# -- YOUR CODE HERE
# select name, DATEDIFF(day, birthday, '5/29') AS DateDiff;
# order by datediff

# '''
# pd.read_sql_query(sql, conn)